Repository: KDE/ksudoku
Catalog: po/*/ksudoku.po
Languages: el, eo

# @action
source: Select %1 (%2)
eo: Elekti %1 (%2)

# @action
source: Enter %1 (%2)
eo: Tajpi %1 (%2)

# @action
source: Mark %1 (%2)
eo: Marki %1 (%2)

# @action
source: Move Up
eo: Supren

# @action
source: Move Down
eo: Malsupren

# @action
source: Move Left
eo: Maldekstren

# @action
source: Move Right
eo: Dekstren

# @action
source: Clear Cell
eo: VIŝi ĉelon

source: GetNewVariant not implemented
el: Δεν έχει υλοποιηθεί η GetNewVariant
eo: GetNewVariant ankoraŭ ne realigita

source: Please select a puzzle variant.
eo: Bonvolu elekti enigmo-variaĵon.

# @title:window
source: Unable to Start Puzzle
eo: Ne Eblas Komenci Enigmon

source: Unable to create an empty puzzle of the chosen variant; please try another.
eo: Ne eblas krei malplenan enigmon de la elektita varianto; bonvolu provi alian.

source: Unable to start a puzzle of the chosen variant; please try another.
eo: Ne eblas komenci enigmon de la elektita varianto; bonvolu provi alian.

source: Unable to generate a puzzle of the chosen variant; please try another.
eo: Ne eblas generi enigmon de la elektita varianto; bonvolu provi alian.

source: Choose your Game
el: Επιλέξτε το παιχνίδι σας
eo: Elektu vian ludon

source: Get New
el: Λήψη νέου
eo: Akiri novan

source: Enter In A Puzzle
el: Είσοδος σε παζλ
eo: Eniri En Enigmo

source: Generate A Puzzle
el: Δημιουργία παζλ
eo: Generi Enigmon

source: Attempts to generate a puzzle failed after about 200 tries. Try again?
eo: Provoj generi enigmon malsukcesis post ĉirkaŭ 200 provoj. Ĉu provi denove?

# @title:window
source: Mathdoku or Killer Sudoku Puzzle
eo: Mathdoku aŭ Killer Sudoku-Enigmo

# @action:button
source: &Try Again
eo: &Provi denove

# @title:window
source: Difficulty Level
eo: Nivelo de malfacilaĵo

# @action:button
source: &Retry
eo: &Reprovi

source: KSudoku - Sudokus and more
el: KSudoku - Sudoku και άλλα
eo: KSudoku - Sudokuoj kaj pliaj

source: (c) 2005-2007 The KSudoku Authors
el: (c) 2005-2007 Οι δημιουργοί του KSudoku
eo: (c) 2005-2007 La KSudoku Aŭtoroj

source: KSudoku Author
el: Συγγραφέας του KSudoku
eo: KSudoku Aŭtoro

source: Maintainer
el: Συντηρητής
eo: Fleganto

source: New puzzle generator and solver
el: Νέα γεννήτρια και νέος επιλυτής παζλ
eo: Nova enigmo-generatoro kaj solvanto

source: Printing and export of 0.4
el: Εκτύπωση και εξαγωγή του 0.4
eo: ̈̈Printi kaj eksporti de 0.4

source: Thanks to NeHe for OpenGL tutorials
el: Ευχαριστίες στο NeHe για τα μαθήματα opengl
eo: Dankon al NeHe por OpenGL Lerniloj

source: Algorithms for new puzzle generator and solver at davidbau.com/archives/2006/09/04/sudoku_generator.html
el: Αλγόριθμοι για τη νέα γεννήτρια και τον νέο επιλυτή στο davidbau.com/archives/2006/09/04/sudoku_generator.html
eo: Algoritmoj por nova enigmogeneratoro kaj solvanto ĉe davidbau.com/archives/2006/09/04/sudoku_generator.html

source: Document to open
el: Έγγραφο για άνοιγμα
eo: Dokumento malfermenda

source: &Try Again
el: &Προσπαθήστε ξανά

source: Difficulty Level
el: Επίπεδο δυσκολίας

source: &Accept
el: &Αποδοχή

source: &Retry
el: &Προσπαθήστε ξανά

source: Play Puzzle
el: Παίξιμο παζλ

source: Play
el: Παιχνίδι

source: Check
el: Έλεγχος

source: Could not load game.
el: Αδυναμία φόρτωσης του παιχνιδιού.

# button label
source: Restart Game
el: Επανεκκίνηση παιχνιδιού

source: Open Location
el: Άνοιγμα τοποθεσίας

# Game Section in Config
source: Game
el: Παιχνίδι

source: Theme
el: Θέμα

source: Warning
el: Προειδοποίηση

source: Print Sudoku Puzzle
el: Εκτύπωση παζλ sudoku

source: Select %1 (%2)
el: Επιλογή %1 (%2)

source: Enter %1 (%2)
el: Εισαγωγή %1 (%2)

source: Mark %1 (%2)
el: Σημείωση %1 (%2)

source: Move Up
el: Μετακίνηση πάνω

source: Move Down
el: Μετακίνηση κάτω

source: Move Left
el: Μετακίνηση αριστερά

source: Move Right
el: Μετακίνηση δεξιά

source: Clear Cell
el: Καθαρισμός κελιού
