Repository: KDE/ksudoku
Catalog: po/*/ksudoku.po
Languages: el, eo

# NAME OF TRANSLATORS
source: Your names
el: Σπύρος Γεωργαράς,Τούσης Μανώλης, Γιάννης Κασκαμανίδης
eo: Emmanuelle Richard,Oliver Kellogg

# EMAIL OF TRANSLATORS
source: Your emails
el: sngeorgaras@otenet.gr,manolis@koppermind.homelinux.org, ttnfy17@sch.gr
eo: emmanuelle@esperanto-jeunes.org,olivermkellogg@gmail.com

source: After %1 tries, the best difficulty level achieved by the generator is %2, with internal difficulty rating %3, but you requested difficulty level %4. Do you wish to let the generator try again or accept the puzzle as is? Hint: you can try to increase the difficulty rating by doing the following: Continue with the 'OK' button, choose Game -> New, then change the Symmetry setting to 'No Symmetry' or some low symmetry type and then use 'Generate A Puzzle' again.
eo: Post %1 provoj, la plej bona malfacilecnivelo atingita de la generatoro estas %2, kun interna malfacilecnivelo %3, sed vi petis malfacilecnivelon %4. Ĉu vi volas lasi la generatoron provi denove aŭ akcepti la enigmon kiel estas. ? Konsilo: vi povas provi pliigi la malfacilec-takson farante la jenon: Daŭrigu per la butono 'Bone', elektu Ludo -> Nova, tiam ŝanĝu la Simetri-agordon al 'Neniu Simetrio' aŭ iun malaltan simetrian tipon kaj poste uzu 'Generi Enigmon' denove.

source: It will be possible to solve the generated puzzle by logic alone. No guessing will be required. The internal difficulty rating is %1. There are %2 clues at the start and %3 moves to go.
el: Θα καταστεί δυνατή η επίλυση του δημιουργημένου παζλ με τη λογική και μόνο. Δε θα είναι απαραίτητο να μαντέψετε. Η εσωτερική κατάταξη δυσκολίας είναι %1. Υπάρχουν %2 στοιχεία υπόδειξης κατά την εκκίνηση και %3 κινήσεις να γίνουν.
eo: Eblos solvi la generitan enigmon nur per logiko. Neniu diveno estos bezonata. La interna malfacileca takso estas %1. Estas %2 indicoj ĉe la komenco kaj %3 movoj por daŭri.

source: Solving the generated puzzle will require an average of %1 guesses or branch points and if you guess wrong, backtracking will be necessary. The first guess should come after %2 moves. The internal difficulty rating is %3, there are %4 clues at the start and %5 moves to go.
el: Η επίλυση του παζλ που θα δημιουργηθεί θα απαιτεί έναν μέσο όρο %1 μαντεψιών ή σημείων διακλάδωσης και αν μαντέψετε λανθασμένα, θα χρειαστεί να γυρίσετε πίσω. Η πρώτη μαντεψιά θα έρθει μετά από %2 κινήσεις. Η εσωτερική κατάταξη δυσκολίας είναι %3, υπάρχουν %4 στοιχεία υπόδειξης κατά την εκκίνηση και %5 κινήσεις να γίνουν.
eo: Solvi la generitan enigmon postulos averaĝe %1 divenoj aŭ branĉpunktoj kaj se vi divenas malĝuste, retrovojiĝo estos necesa. La unua supozo devus veni post %2 movoj. La interna malfacilec-taksado estas %3, estas %4 indikoj ĉe la komenco kaj %5 movoj daŭras.

source: When printing, try to fit more than one puzzle on a page
el: Κατά την εκτύπωση, να γίνει προσπάθεια να χωρέσουν περισσότερα του ενός παζλ σε μια σελίδα
eo: Presante, provu alĝustigi pli ol unu enigmon sur paĝo

source: Highlight the row, column and block that contain the selected cell
el: Τονισμός της γραμμής, της στήλης και του τμήματος που περιέχει το επιλεγμένο κελί
eo: Marki la vicon, kolumnon kaj blokon, kiuj enhavas la elektitan ĉelon

source: Highlight the row, column and block that contain the selected cell. Blocks may be square or irregular (as in jigsaw-type or XSudoku puzzles).
el: Τονισμός της γραμμής, της στήλης και του τμήματος που περιέχει το επιλεγμένο κελί. Τα τμήματα μπορεί να είναι τετράγωνα ή ακανόνιστου σχήματος (όπως στα τύπου jigsaw ή τα παζλ XSudoku)
eo: Marki la vicon, kolumnon kaj blokon, kiuj enhavas la elektitan ĉelon. Blokoj povas esti kvadrataj aŭ neregulaj (kiel en puzlo-specaj aŭ XSudoku-enigmoj).

source: Show highlights in 2-D puzzles
el: Εμφάνιση τονισμών στα δισδιάστατα παζλ
eo: Montri kulminaĵojn en 2-D enigmoj

source: Highlight in red any cells whose values break the Sudoku rules.
el: Τονισμός με κόκκινο των κελιών οι τιμές των οποίων παραβιάζουν τους κανόνες του Sudoku.
eo: Marki ruĝe iujn ajn ĉelojn, kies valoroj malobeas la regulojn de Sudoku.

source: Show errors
el: Εμφάνιση σφαλμάτων
eo: Montri erarojn

source: Highlight the planes (blocks) that contain the selected cell.
el: Τονισμός των τμημάτων που περιέχουν το επιλεγμένο κελί.
eo: Marki la ebenojn (blokojn) kiuj enhavas la elektitan ĉelon.

source: Show highlights in 3-D puzzles
el: Εμφάνιση τονισμών στα τρισδιάστατα παζλ
eo: Montri elstaraĵojn en 3-D enigmoj

source: Mathdoku puzzle size (3-9)
eo: Mathdoku-enigmograndeco (3-9)

source: Settings for 3-D Puzzles Only
el: Ρυθμίσεις μόνο για τρισδιάστατα παζλ
eo: Agordoj por 3-D Puzloj Nur

source: Set the relative size of 3-D cells and the spaces between them.
el: Καθορισμός του σχετικού μεγέθους των τρισδιάστατων κελιών και των μεταξύ τους διαστημάτων.
eo: Fiksi la relativan grandecon de 3-D ĉeloj kaj la spacojn inter ili.

source: Overall size of 3-D cells
el: Συνολικό μέγεθος των τρισδιάστατων κελιών
eo: Totala grandeco de 3-D ĉeloj

source: Shrink or expand a cell by up to 30% when it is selected.
el: Σμίκρυνση ή επέκταση ενός κελιού ως και κατά 30% όταν είναι επιλεγμένο.
eo: Ŝrumpi aŭ pligrandigi ĉelon ĝis 30% kiam ĝi estas elektita.

source: Size of selected 3-D cell
el: Μέγεθος επιλεγμένου τρισδιάστατου κελιού
eo: Grandeco de elektita 3-D ĉelo

source: Shrink or expand cells by up to 30% when they are highlighted.
el: Σμίκρυνση ή επέκταση κελιών ως και κατά 30% όταν είναι τονισμένα.
eo: Ŝrumpi aŭ pligrandigi ĉelojn ĝis 30% kiam ili estas reliefigitaj.

source: Size of highlighted 3-D cells
el: Μέγεθος τονισμένων τρισδιάστατων κελιών
eo: Grandeco de reliefigitaj 3-D ĉeloj

source: Shrink cells by up to 60% if they are not in an NxNxN cube that contains the selected cell.
el: Σμίκρυνση κελιών ως και κατά 60% αν δε βρίσκονται μέσα σε έναν κύβο NxNxN που περιέχει το επιλεγμένο κελί.
eo: Ŝrumpi ĉelojn ĝis 60% se ili ne estas en NxNxN-kubo, kiu enhavas la elektitan ĉelon.

source: Shrink cells by up to 60% if they are not in an NxNxN cube that contains the selected cell. This is useful if a 3-D puzzle has more than one cube.
el: Σμίκρυνση κελιών ως και κατά 60% αν δε βρίσκονται μέσα σε έναν κύβο NxNxN που περιέχει το επιλεγμένο κελί. Χρήσιμο αν ένα τρισδιάστατο παζλ έχει περισσότερους του ενός κύβους.
eo: Ŝrumpi ĉelojn ĝis 60% se ili ne estas en NxNxN-kubo, kiu enhavas la elektitan ĉelon. Ĉi tio estas utila se 3-D enigmo havas pli ol unu kubon.

source: Size of 3-D cells outside the selected volume
el: Μέγεθος των τρισδιάστατων κελιών εκτός του επιλεγμένου πλήθους
eo: Grandeco de 3-D ĉeloj ekster la elektita volumeno

source: Darken cells if they are not in an NxNxN cube that contains the selected cell.
el: Σκίαση κελιών αν δε βρίσκονται σε έναν κύβο NxNxN που περιέχει το επιλεγμένο κελί.
eo: Malheligi ĉelojn se ili ne estas en kubo NxNxN kiu enhavas la elektitan ĉelon.

source: Darken 3-D cells outside the selected volume
el: Σκίαση των τρισδιάστατων κελιών εκτός του επιλεγμένου πλήθους
eo: Mallumigi 3-D-ĉelojn ekster la elektita volumeno

source: Configuration not yet implemented
el: Η διαμόρφωση δεν έχει εφαρμοστεί ακόμα
eo: Vi ankoraŭ ne agordis

source: Sorry, your solution contains mistakes. Enable "Show errors" in the settings to highlight them.
el: Δυστυχώς, η λύση σας περιέχει σφάλματα. Ενεργοποιήσετε την "Εμφάνιση σφαλμάτων" στις ρυθμίσεις για τον τονισμό τους.
eo: Bedaŭrinde, via solvo enhavas erarojn. Bonvolu ebligi "Montri erarojn" en la akordoj por marki ilin.

source: Congratulations! You made it in 1 second. With some tricks.
el: Συγχαρητήρια! Τελειώσατε σε 1 δευτερόλεπτο. Με κάποια τεχνάσματα.
eo: Gratulojn! Vi faris ĝin en 1 sekundo. Kun kelkaj trukoj.

source: Congratulations! You made it in 1 minute. With some tricks.
el: Συγχαρητήρια! Τελειώσατε σε 1 λεπτό. Με κάποια τεχνάσματα.
eo: Gratulojn! Vi faris ĝin en 1 minuto. Kun kelkaj trukoj.

source: 1 minute
el: 1 λεπτό
eo: 1 minuto

source: 1 second
el: 1 δευτερόλεπτο
eo: 1 sekundo

# The two parameters are strings like '2 minutes' or '1 second'.
source: Congratulations! You made it in %1 and %2. With some tricks.
el: Συγχαρητήρια! Τελειώσατε σε %1 και %2. Με κάποια τεχνάσματα.
eo: Gratulon! You made it in %1 and %2. With some tricks.

source: Congratulations! You made it in 1 second.
el: Συγχαρητήρια! Τα καταφέρατε σε 1 δευτερόλεπτο.
eo: Gratulon! Vi finis ĝin en 1 sekundo.

source: Congratulations! You made it in 1 minute.
el: Συγχαρητήρια! Τα καταφέρατε σε 1 λεπτό.
eo: Gratulon! Vi finis ĝin en 1 minuto.

# The two parameters are strings like '2 minutes' or '1 second'.
source: Congratulations! You made it in %1 and %2.
el: Συγχαρητήρια! Τα καταφέρατε σε %1 και %2.
eo: Gratulon! Vi finis ĝin en %1 kaj %2.

source: Sudoku Standard (9x9)
el: Τυπικό Sudoku (9x9)
eo: Norma Sudoko (9x9)

source: The classic and fashionable game
el: Το κλασικό και δημοφιλές παιχνίδι
eo: Klasika kaj lăumoda ludo

source: Roxdoku 9 (3x3x3)
eo: Roxdoko 9 (3x3x3)

source: The Rox 3D Sudoku
el: Το sudoku Rox 3D
eo: La Rox 3D Sudoko

source: Missing Variant Name
el: Λείπει όνομα παραλλαγής
eo: Mankas Varianta Nomo

source: Sudoku 16x16
eo: Sudoko 16x16

source: Sudoku with 16 symbols
el: Sudoku με 16 σύμβολα
eo: Sudoko kun 16 simboloj

source: Sudoku 25x25
eo: Sudoko 25x25

source: Sudoku with 25 symbols
el: Sudoku με 25 σύμβολα
eo: Sudoko kun 25 simboloj

source: Roxdoku 16 (4x4x4)
eo: Roxdoko 16 (4x4x4)

source: The Rox 3D sudoku with 16 symbols
el: Το Rox 3D sudoku με 16 σύμβολα
eo: La Rox 3D sudoko kun 16 simboloj

source: Roxdoku 25 (5x5x5)
eo: Roxdoko 25 (5x5x5)

source: The Rox 3D sudoku with 25 symbols
el: Το Rox 3D sudoku με 25 σύμβολα
eo: La Rox 3D sudoko kun 25 simboloj

source: Mathdoku puzzles can have any size from 3x3 up to 9x9. The solution is a grid in which every row and every column contains the available digits (1-3 up to 1-9) exactly once. The grid is covered with irregularly shaped cages. Cages of size 1 are starting-values or clues, but there are not many of them. Cages of larger size have a target value and an arithmetic operator (+-x/). The digits in the cage must combine together, using the operator, to reach the target value, e.g. '12x' means that the digits must multiply together to make 12. A digit can occur more than once in a cage, provided it occurs in different rows and columns. In general, larger Mathdokus are more difficult and so are larger cages. You can select the puzzle size in KSudoku's Settings dialog and the maximum cage-size by using KSudoku's Difficulty button.
eo: Mathdoku-enigmoj povas havi ajnan grandecon de 3x3 ĝis 9x9. La solvo estas krado en kiu ĉiu vico kaj ĉiu kolumno enhavas la disponeblajn ciferojn (1-3 ĝis 1-9) ekzakte unufoje. La krado estas kovrita per neregulaj kaĝoj. Kaĝoj de grandeco 1 estas komencaj valoroj aŭ indicoj, sed ne estas multaj el ili. Kaĝoj de pli granda grandeco havas celvaloron kaj aritmetikan operatoron (+-x/). La ciferoj en la kaĝo devas kombini kune, uzante la funkciigiston, por atingi la celvaloron, ekz. '12x' signifas, ke la ciferoj devas multobliĝi kune por fari 12. Cifero povas okazi pli ol unufoje en kaĝo, kondiĉe ke ĝi okazas en malsamaj vicoj kaj kolumnoj. Ĝenerale, pli grandaj Mathdokus estas pli malfacilaj kaj ankaŭ pli grandaj kaĝoj. . Vi povas elekti la enigmon en la dialogo Agordoj de KSudoku kaj la maksimuman kaĝgrandecon per la butono de Malfacilaĵo de KSudoku.

source: Playing Mathdoku
eo: Ludante Mathdoku

source: Killer Sudoku puzzles can have sizes 4x4 or 9x9, with either four 2x2 blocks or nine 3x3 blocks. The solution must follow Classic Sudoku rules. The difference is that there are few starting-values or clues (if any). Instead the grid is covered with irregularly shaped cages. Cages of size 1 are starting-values or clues. Cages of larger size have a target value and the digits in them must add up to that value. In Killer Sudoku, a cage cannot contain any digit more than once. In general, larger cages are more difficult. You can select the maximum cage-size by using KSudoku's Difficulty button.
eo: Killer Sudoku-enigmoj povas havi grandecojn 4x4 aŭ 9x9, kun aŭ kvar 2x2 blokoj aŭ naŭ 3x3 blokoj. La solvo devas sekvi Klasikan Sudoku-regulojn. La diferenco estas, ke ekzistas malmultaj komencaj valoroj aŭ indicoj (se ekzistas). Anstataŭe la krado estas kovrita per nereguleformaj kaĝoj. Kaĝoj de grandeco 1 estas komencaj valoroj aŭ indicoj. Kaĝoj de pli granda grandeco havas celvaloron kaj la ciferoj en ili devas sumiĝi al tiu valoro. En Killer Sudoku, kaĝo ne povas enhavi ajnan ciferon pli ol unufoje. Ĝenerale, pli grandaj kaĝoj estas pli malfacilaj. Vi povas elekti la maksimuman kaĝgrandecon per la butono de Malfacileco de KSudoku.

source: Playing Killer Sudoku
eo: Ludante Killer-Sudoku

source: Mathdoku and Killer Sudoku puzzles have to be keyed in by working on one cage at a time. To start a cage, left click on any unused cell or enter a number in the cell that is under the cursor or enter + - / or x there. A small cage-label will appear in that cell. To extend the cage in any direction, left-click on a neigbouring cell or move the cursor there and type a Space. The number you type is the cage's value and it can have one or more digits, including zero. A cell of size 1 has to have a 1-digit number, as in a normal Sudoku puzzle. It becomes a starting-value or clue for the player. The + - / or x is the operator (Add, Subtract, Divide or Multiply). You must have one in cages of size 2 or more. In Killer Sudoku, the operator is provided automatically because it is always + or none. You can enter digits, operators and cells in any order. To complete the cage and start another cage, always press Return. If you make a mistake, the only thing to do is delete a whole cage and re-enter it. Use right click in the current cage or any earlier cage, if you wish to delete it. Alternatively, use the cursor and the Delete or Backspace key. When the grid is filled with cages, hit the Check button, to solve the puzzle and make sure there is only one solution. If the check fails, you have probably made an error somewhere in one of the cages.
eo: Mathdoku kaj Killer Sudoku-enigmoj devas esti klavigitaj per laborado pri unu kaĝo samtempe. Por komenci kaĝon, maldekstre alklaku iun ajn neuzatan ĉelon aŭ enigu numeron en la ĉelo kiu estas sub la kursoro aŭ enigu + - / aŭ x tie. Malgranda kaĝo-etikedo aperos en tiu ĉelo. Por etendi la kaĝon en ajna direkto, maldekstre alklaku najbaran ĉelon aŭ movu la kursoron tien kaj tajpu Spacon. La nombro, kiun vi tajpas, estas la valoro de la kaĝo kaj ĝi povas havi unu aŭ plurajn ciferojn, inkluzive de nulo. Ĉelo de grandeco 1 devas havi 1-ciferan nombron, kiel en normala Sudoku-enigmo. Ĝi fariĝas komenca valoro aŭ indico por la ludanto. La + - / aŭ x estas la operatoro (Aldoni, Subtrahi, Dividi aŭ Multipliki). Vi devas havi unu en kaĝoj de grandeco 2 aŭ pli. En Killer Sudoku, la funkciigisto estas provizita aŭtomate ĉar ĝi estas ĉiam + aŭ neniu. Vi povas enigi ciferojn, funkciigistojn kaj ĉelojn en ajna ordo. Por kompletigi la kaĝon kaj komenci alian kaĝon, ĉiam premu Reen. Se vi eraras, la nura afero estas forigi tutan kaĝon kaj reeniri ĝin. Uzu dekstran klakon en la nuna kaĝo aŭ ajna pli frua kaĝo, se vi volas forigi ĝin. Alternative, uzu la kursoron kaj la klavon Forigi aŭ Backspace. Kiam la krado estas plenigita de kaĝoj, premu la butonon Kontrolo, por solvi la enigmon kaj certigi, ke ekzistas nur unu solvo. Se la kontrolo malsukcesas, vi verŝajne faris eraron ie en unu el la kaĝoj.

source: Data-entry for Puzzles with Cages
eo: Enigo de datumoj por Enigmoj kun Kaĝoj

source: The puzzle you entered contains some errors.
el: Το παζλ στο οποίο μπήκατε περιέχει κάποια σφάλματα.
eo: La ludo, kiun vi kreis enhavas erarojn.

source: Sorry, no solutions have been found. Please check that you have entered in the puzzle completely and correctly.
eo: Pardonu, neniuj solvoj estis trovitaj. Bonvolu kontroli, ke vi eniris la enigmon tute kaj ĝuste.

# @title:window
source: Check Puzzle
eo: Kontroli Puzlon

source: The Puzzle you entered has a unique solution and is ready to be played.
eo: La Enigmo, kiun vi enigis, havas unikan solvon kaj estas preta por esti ludita.

source: The Puzzle you entered has multiple solutions. Please check that you have entered in the puzzle completely and correctly.
eo: La Enigmo, kiun vi enigis, havas plurajn solvojn. Bonvolu kontroli, ke vi eniris la enigmon tute kaj ĝuste.

source: Do you wish to play the puzzle now?
eo: Ĉu vi volas ludi la enigmon nun?

# @title:window
source: Play Puzzle
eo: Ludi

# @action:button
source: Play
eo: Ludi

# @action
source: Enable All Messages
eo: Ebligi Ĉiujn Mesaĝojn

# @action
source: Check
eo: Kontroli

# A level of difficulty in Sudoku puzzles
source: Diabolical
el: Διαβολικό
eo: Diabla

# A level of difficulty in Sudoku puzzles
source: Unlimited
el: Χωρίς όριο
eo: Senlima

# @option drop down box
source: Difficulty:
eo: Malfacileco:

# @option drop down box
source: Symmetry:
eo: Simetrio:

# Symmetry of layout of clues when puzzle starts
source: Symmetry
el: Συμμετρία
eo: Simetrio

source: The symmetry of layout of the clues when the puzzle starts
el: Η συμμετρία της διάταξης των στοιχείων υπόδειξης κατά την εκκίνηση του παζλ
eo: La simetrio de aranĝo de la indicoj kiam la enigmo komenciĝas

# Symmetry of layout of clues
source: Diagonal
el: Διαγώνια
eo: Diagonala

# Symmetry of layout of clues
source: Central
el: Στο κέντρο
eo: Centra

# Symmetry of layout of clues
source: Left-Right
el: Αριστερά-Δεξιά
eo: Maldekstra-Dekstra

# Symmetry of layout of clues
source: Spiral
el: Σπειροειδής
eo: Spiralo

# Symmetry of layout of clues
source: Four-Way
el: Τεσσάρων κατευθύνσεων
eo: Kvar-Voja

# Symmetry of layout of clues
source: Random Choice
el: Τυχαία επιλογή
eo: Hazarda Elekto

source: No Symmetry
el: Χωρίς συμμετρία
eo: Neniu Simetrio

# @title:window
source: Error Loading Game
eo: Eraro Ŝargante Ludon

source: Do you really want to end this game in order to start a new one?
el: Επιθυμείτε πραγματικά τον τερματισμό του παιχνιδιού για την έναρξη νέου;
eo: ̈̈Ĉu vi vere volas fini tiun ludon kaj komenci novan?

# window title
source: New Game
eo: Nova Ludo

# @action:button
source: New Game
eo: Nova Ludo

source: Do you really want to restart this game?
eo: Ĉu vi vere volas rekomenci ĉi tiun ludon?

# window title
source: Restart Game
el: Επανεκκίνηση παιχνιδιού
eo: Rekomenci Ludon

# @action:button
source: Restart Game
eo: Rekomenci Ludon

# @title:window
source: Error Writing File
eo: Eraro dum Skriba Dosiero

source: Game_
eo: Ludo_

source: Save Game
eo: Konservi Ludon

source: There seems to be no puzzle to print.
el: Φαίνεται πως δεν υπάρχει παζλ για εκτύπωση.
eo: Ŝajnas esti neniu enigmo por presi.

# @title:tab Game Section in Config
source: Game
eo: Ludo

# @title:tab
source: Theme
eo: Etoso

source: Warning: The Unlimited difficulty level has no limit on how many guesses or branch points are required to solve the puzzle and there is no lower limit on how soon guessing becomes necessary. Please also note that the generation of this type of puzzle might take much longer than other ones. During this time KSudoku will not respond.
eo: Averto: La Senlima malfacilecnivelo havas neniun limon pri kiom da divenoj aŭ branĉpunktoj necesas por solvi la enigmon kaj ne estas pli malalta limo pri kiom baldaŭ divenado iĝas necesa. Bonvolu noti ankaŭ, ke la generacio de ĉi tiu speco de enigmo eble povus. daŭras multe pli longe ol aliaj. Dum ĉi tiu tempo KSudoku ne respondos.

# @title:window
source: Warning
eo: Averto

source: This will enable all the dialogs that you had disabled by marking the 'Do not show this message again' option. Do you want to continue?
eo: Ĉi tio ebligos ĉiujn dialogojn, kiujn vi malŝaltis, markante la opcion 'Ne montru ĉi tiun mesaĝon denove'. Ĉu vi volas daŭrigi?

# @action:button
source: Enable
eo: Ebligi

source: The graphical theme to be used.
el: Το γραφικό θέμα που θα χρησιμοποιηθεί.
eo: Grafika etoso uzenda.

source: Select the themes you want to use
el: Επιλέξτε τα θέματα που επιθυμείτε να χρησιμοποιήσετε
eo: Elektu la etosojn, kiujn vi volas uzi.

source: In Killer Sudoku, the operator is always + or none and KSudoku automatically sets the correct choice.
eo: En Killer Sudoku, la funkciigisto ĉiam estas + aŭ neniu kaj KSudoku aŭtomate fiksas la ĝustan elekton.

# @title:window
source: Killer Sudoku Cage
eo: Killer-Sudoku Kaĝo

source: The cell you have selected has already been used in a cage.
eo: La ĉelo, kiun vi elektis, jam estis uzata en kaĝo.

# @title:window
source: Error in Cage
eo: Eraro en Kaĝo

source: The cell you have selected is not next to any cell in the cage you are creating.
eo: La ĉelo, kiun vi elektis, ne estas apud iu ajn ĉelo en la kaĝo, kiun vi kreas.

source: The cage you wish to complete has no cells in it yet. Please click on a cell or key in + - / x or a number.
eo: La kaĝo, kiun vi volas kompletigi, ankoraŭ ne havas ĉelojn en ĝi. Bonvolu alklaki ĉelon aŭ klavon en + - / x aŭ numeron.

source: The cage you wish to complete has no value yet. Please key in a number with one or more digits.
eo: La kaĝo, kiun vi volas kompletigi, ankoraŭ ne havas valoron. Bonvolu entajpi numeron kun unu aŭ pluraj ciferoj.

source: The cage you wish to complete has more than one cell, but it has no operator yet. Please key in + - / or x.
eo: La kaĝo, kiun vi volas kompletigi, havas pli ol unu ĉelon, sed ĝi ankoraŭ ne havas funkciigiston. Bonvolu entajpi + - / aŭ x.

source: The cage you wish to complete has one cell, but its value is too large. A single-cell cage must have a value from 1 to %1 in a puzzle of this size.
eo: La kaĝo, kiun vi volas kompletigi, havas unu ĉelon, sed ĝia valoro estas tro granda. Unuĉela kaĝo devas havi valoron de 1 ĝis %1 en enigmo de ĉi tiu grandeco.

source: Do you wish to delete this cage?
eo: Ĉu vi volas forigi ĉi tiun kaĝon?

# @title:window
source: Delete Cage
eo: Forigi Kaĝon

source: The cell you have selected is not in any cage, so the Delete action will not delete anything.
eo: La ĉelo, kiun vi elektis, estas en neniu kaĝo, do la ago Forigi nenion forigos.

source: The Delete action finds that there are no cages to delete.
eo: La ago Forigi trovas ke ne estas kaĝoj por forigi.

source: &Game
el: &Παιχνίδι
eo: &Ludo

source: &Move
el: &Μετακίνηση
eo: &Movi

source: &Help
el: &Βοήθεια
eo: &Helpo

source: Main Toolbar
el: Κύρια γραμμή εργαλείων
eo: Ĉefa ilobreta

source: Actions Toolbar
el: Γραμμή εργαλείων ενεργειών
eo: Agoj-ilbreto

source: Sorry, cannot print three-dimensional puzzles.
el: Λυπούμαστε, δεν μπορούν να εκτυπωθούν τρισδιάστατα παζλ.
eo: Pardonu, mi ne povas presi tridimensiajn enigmojn.

source: The KSudoku setting for printing several puzzles per page is currently selected. Your puzzle will be printed when no more will fit on the page or when KSudoku terminates.
el: Έχει επιλεγεί η ρύθμιση του KSudoku για εκτύπωση πολλαπλών παζλ ανά σελίδα. Το παζλ σας θα εκτυπωθεί όταν δε χωράνε πλέον άλλα στη σελίδα ή κατά τον τερματισμό του KSudoku.
eo: La agordo de KSudoku por presi plurajn enigmojn po paĝo estas nuntempe elektita. Via enigmo estos presita kiam ne plu taŭgas sur la paĝo aŭ kiam KSudoku finiĝos.

source: KSudoku has sent output to your printer.
el: Το KSudoku έστειλε την έξοδο στον εκτυπωτή σας.
eo: KSudoku sendis eliron al via presilo.

# @title:window
source: Print Sudoku Puzzle
eo: Presi Sudoku-Enigmon

source: Unable to download file: URL is empty.
eo: Ne eblas elŝuti dosieron: URL estas malplena.

source: Unable to open file.
eo: Ne eblas malfermi dosieron.

source: Cannot read XML file on line %1
el: Αδυναμία ανάγνωσης του αρχείου XML στη γραμμή %1
eo: Ne eblas legi XML dosieron en linio %1

source: Unable to download file.
eo: Ne eblas elŝuti dosieron.

source: Unable to create temporary file.
eo: Ne eblas krei provizoran dosieron.

source: Unable to upload file.
eo: Ne eblas alŝuti dosieron.
